Documents/ЗаявлениеНаПредоставлениеВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаПредоставлениеВычетовИПН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрименениеВычетовИПН</xr:Item>
				<xr:Item>InformationRegister.ВычетыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ЛьготыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ПрочиеВычетыФизическихЛицИПН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПодтверждающийПравоНаЛьготу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПрочиеВычеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЗаявления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПодтверждающийПравоНаВычет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставлятьВычет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусФизическихЛицКакНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусФизическихЛицКакНалогоплательщиков</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФизическихЛицНалогоплательщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмеетПравоНаПенсионноеОбеспечение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуМедицинскомуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрочиеВычетыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрочиеВычетыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыФизическихЛицНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыФизическихЛицНалогоплательщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Резидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПредоставленияВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПредоставленияВычетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчисленнойСуммеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодическимПлатежам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявлениеНаПредоставлениеВычетовИПН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Сотрудник");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка ИЛИ Месяц < '2018-01-01' Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ НаличиеЗаявления И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РежимЗаписи    = ?(Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
		ТекстСообщения = НСтр("ru = 'Проведение документа возможно только после установки флага ""Наличие заявления"". Документ будет записан без проведения.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НаличиеЗаявления", "Объект");
		Отказ = Истина;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Статус = РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(Дата, Новый Структура("ФизическоеЛицо", Сотрудник));
		НеРезидентРК = Ложь;
		Если Статус.Количество() > 0 Тогда
			Если Статус[0].Статус = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Нерезидент Тогда
				НеРезидентРК = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НеРезидентРК Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выбранный сотрудник <%1> не является налоговым резидентом РК. Вычеты по ИПН не предоставляются.'"),
				Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Сотрудник", "Объект", Отказ);
			ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УчетНалоговВзносовОтчислений.СформироватьПрименениеСтандартныхВычетов(Движения, Отказ, ДанныеДляПроведения());
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// С 2025 года для новых заявлений на вычеты ограничиваем ввод заявление на календарный года
    Если Вычеты.НайтиСтроки(Новый Структура("ВидВычетаИПН", Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов)).Количество() > 0 Тогда
		
		Если НЕ Год(Месяц) = Год(МесяцЗавершения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При использовании предварительной суммы прочих налоговых вычетов, необходимо ограничить период заявления (""Месяц"", ""Действует по"") в пределах календарного года (заявление формируется на календарный год)'"), , "Месяц", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(МесяцЗавершения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При использовании предварительной суммы прочих налоговых вычетов, необходимо заполнить ""Действует по"" (заявление формируется на календарный год)'"), , "МесяцЗавершенияСтрокой", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// с 2019 года вычеты могут назначаться не только для сотрудника, но ГПХ через документ РегистрацияПрочихДоходов
	Если Месяц < '2019-01-01' Тогда
		
		ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияРабочихМестВОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудниковОрганизаций.Организация 					= Организация;
		ПараметрыПолученияСотрудниковОрганизаций.ОтбиратьПоГоловнойОрганизации	= Истина;
		ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода					= НачалоМесяца(Месяц);
		ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода				= КонецМесяца(Месяц);
		
		КадровыйУчет.ПроверитьРаботающихФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник),
			ПараметрыПолученияСотрудниковОрганизаций,
			Отказ,
			Новый Структура("ИмяПоляСотрудник, ИмяОбъекта", "Сотрудник", "Объект")
		);
		
	КонецЕсли;	
		
	Если Месяц < '2018-01-01' Тогда
		Если НЕ ИзменитьСтандартныйВычет И НЕ ИзменитьЛьготу И НЕ ИзменитьПрочиеВычеты Тогда
			ТекстСообщения = НСтр("ru = 'Должен быть указан или стандартный вычет, или льгота, или прочие вычеты.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Вычеты");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Вычеты.ВидВычетаИПН");
	Иначе
		Если ЗначениеЗаполнено(МесяцЗавершения) И Месяц > МесяцЗавершения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Месяц начала действия заявления превышает месяц окончания'"), ,"МесяцЗавершенияСтрокой",,Отказ);
		КонецЕсли;
		ПроверитьПрочиеВычеты(Отказ);
		
		Для каждого ПрочийВычет Из ПрочиеВычеты Цикл
			
			Если ПрочийВычет.ДействуетПо > МесяцЗавершения
					И ЗначениеЗаполнено(МесяцЗавершения)  Тогда
				
				СтрокаВычета = Вычеты.Найти(ПрочийВычет.ВидВычетаИПН,"ВидВычетаИПН");
				Если СтрокаВычета <> Неопределено Тогда
					ТекстСообщения = 
						НСтр("ru='В строке %1 для вычета ""%2"" в графике указана дата окончания действия, превышающая дату окончания действия заявления.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстСообщения,СтрокаВычета.НомерСтроки ,СтрокаВычета.ВидВычетаИПН);
					ПозицияСообщения = "Объект.Вычеты[%1].ВидВычетаИПН";
					ПозицияСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПозицияСообщения,Формат(СтрокаВычета.НомерСтроки - 1,"ЧН=0;ЧГ=0"));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстСообщения,Ссылка,ПозицияСообщения,,Отказ);
				Иначе
					ТекстСообщения = 
						НСтр("ru='Для вычета ""%1"" в графике указана дата окончания действия, превышающая дату окончания действия заявления.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстСообщения,ПрочийВычет.ВидВычетаИПН);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстСообщения,,,,Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Проверка на дубли движений
	МассивВычетов = Новый Массив;
	Для Каждого СтрокаВычет Из ПрочиеВычеты Цикл
		МассивВычетов.Добавить(СтрокаВычет.ВидВычетаИПН);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЗаявлениеНаПредоставлениеВычетовИПН.ТекстЗапросаКонфликтующиеРегистраторы();
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
	Запрос.УстановитьПараметр("Период",			Месяц);
	Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	Запрос.УстановитьПараметр("ВидыВычетов",	МассивВычетов);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru = 'Заявление за указанный месяц уже зарегистрировано. Требуемые изменения вычетов необходимо провести в документе %1.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Регистратор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор, , , Отказ);
			ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, ТекстСообщения, , Выборка.Регистратор);
		КонецЦикла;
	КонецЕсли;
	
	Если Вычеты.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в табличную часть ""Вычеты"".'"); 
		ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, ТекстСообщения);
	КонецЕсли;
	
	ПроверитьНесовместимыеВычеты(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	ДанныеОВычетах = Новый Структура(
		"МесяцРегистрации,МесяцЗавершения,ФизическоеЛицо,Организация,НаличиеЗаявления,
		|ИзменитьСтандартныйВычет,ПредоставлятьСтандартныйВычет,
		|ИзменитьЛьготу,ПредоставлятьЛьготу,ДействуетДо,КатегорияЛицаПолучателяЛьготы,ДокументПодтверждающийПравоНаЛьготу,
		|ИзменитьПрочиеВычеты,ПрочиеВычеты");
	
	ЗаполнитьЗначенияСвойств(ДанныеОВычетах, СведенияОПримененииВычетовЛьготИПрочихВычетов());
	
	//Схема получения данных для проведения по регистрам до 01 января 2018 года.
	Если Месяц < '2018-01-01' Тогда
		Если ДанныеОВычетах.ИзменитьПрочиеВычеты Тогда
			ДанныеОВычетах.Вставить("ПрочиеВычеты", СведенияОПрочихВычетах(ДанныеОВычетах));
		КонецЕсли;
	//Схема получения данных для проведения по регистрам после 01 января 2018 года.
	Иначе
		ДанныеОВычетах.Вставить("Вычеты",       СведенияОВычетах(ДанныеОВычетах));
		ДанныеОВычетах.Вставить("ПрочиеВычеты", СведенияОПрочихВычетах(ДанныеОВычетах));
	КонецЕсли;
	
	Возврат ДанныеОВычетах;
	
КонецФункции

Функция СведенияОПримененииВычетовЛьготИПрочихВычетов()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Док.Месяц КАК МесяцРегистрации,
	|	Док.Сотрудник КАК ФизическоеЛицо,
	|	Док.Организация КАК Организация,
	|	Док.ИзменитьСтандартныйВычет,
	|	Док.ПредоставлятьСтандартныйВычет,
	|	Док.ИзменитьЛьготу,
	|	Док.ПредоставлятьЛьготу,
	|	Док.ДействуетДо,
	|	Док.КатегорияЛицаПолучателяЛьготы,
	|	Док.ДокументПодтверждающийПравоНаЛьготу КАК ДокументПодтверждающийПравоНаЛьготу,
	|	Док.ИзменитьПрочиеВычеты,
	|	Док.МесяцЗавершения,
	|	Док.НаличиеЗаявления
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН КАК Док
	|ГДЕ
	|	Док.Ссылка = &Документ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СведенияОПрочихВычетах(ДанныеОВычетах)
	
	ТаблицаПрочиеВычеты = Новый ТаблицаЗначений;
	ТаблицаПрочиеВычеты.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаПрочиеВычеты.Колонки.Добавить("МесяцРегистрации");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ВидВычета");
	ТаблицаПрочиеВычеты.Колонки.Добавить("Размер");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ДействуетПо");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ДействуетС");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ДокументПодтверждающийПравоНаВычет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	//Схема получения данных для проведения по регистрам до 01 января 2018 года.
	Если Месяц < '2018-01-01' Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокПрочиеВычеты.ВидВычетаИПН КАК ВидВычета,
		|	ДокПрочиеВычеты.Размер,
		|	ДокПрочиеВычеты.ДействуетПо КАК ДействуетПо,
		|	ДокПрочиеВычеты.ДокументПодтверждающийПравоНаВычет КАК ДокументПодтверждающийПравоНаВычет
		|ИЗ
		|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ДокПрочиеВычеты
		|ГДЕ
		|	ДокПрочиеВычеты.Ссылка = &Документ";
		ПрочиеВычетыВыборка =  Запрос.Выполнить().Выбрать();
		
		Пока ПрочиеВычетыВыборка.Следующий() Цикл
			
			ЗаписьОПрочихВычетах = ТаблицаПрочиеВычеты.Добавить();
			
			ЗаписьОПрочихВычетах.ФизическоеЛицо	  					= ДанныеОВычетах.ФизическоеЛицо;
			ЗаписьОПрочихВычетах.МесяцРегистрации 					= ДанныеОВычетах.МесяцРегистрации;
			ЗаписьОПрочихВычетах.ВидВычета		 					= ПрочиеВычетыВыборка.ВидВычета;
			ЗаписьОПрочихВычетах.Размер			  					= ПрочиеВычетыВыборка.Размер;
			ЗаписьОПрочихВычетах.ДействуетПо	  					= ПрочиеВычетыВыборка.ДействуетПо;
			ЗаписьОПрочихВычетах.ДействуетС	  						= ДанныеОВычетах.МесяцРегистрации;
			ЗаписьОПрочихВычетах.ДокументПодтверждающийПравоНаВычет	= ПрочиеВычетыВыборка.ДокументПодтверждающийПравоНаВычет;
			
		КонецЦикла;
		
	//Схема получения данных для проведения по регистрам после 01 января 2018 года.
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокПрочиеВычеты.ВидВычетаИПН КАК ВидВычета,
		|	ДокПрочиеВычеты.Размер КАК Размер,
		|	ДокПрочиеВычеты.ДействуетПо КАК ДействуетПо,
		|	ДокПрочиеВычеты.ДокументПодтверждающийПравоНаВычет КАК ДокументПодтверждающийПравоНаВычет,
		|	ДокПрочиеВычеты.ДействуетС КАК ДействуетС,
		|	ДокВычеты.ПредоставлятьВычет КАК ПредоставлятьВычет
		|ПОМЕСТИТЬ ВТ_ПрочиеВычеты
		|ИЗ
		|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ДокПрочиеВычеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Вычеты КАК ДокВычеты
		|		ПО ДокПрочиеВычеты.ВидВычетаИПН = ДокВычеты.ВидВычетаИПН
		|			И ДокПрочиеВычеты.Ссылка = ДокВычеты.Ссылка
		|ГДЕ
		|	ДокПрочиеВычеты.Ссылка = &Документ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидВычета,
		|	ДействуетС,
		|	ПредоставлятьВычет,
		|	Размер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МИНИМУМ(ПрочиеВычетыДатаНачала.ДействуетС) КАК МинимумДата,
		|	ПрочиеВычетыДатаНачала.ВидВычета КАК ВидВычета
		|ПОМЕСТИТЬ ВТ_Минимум
		|ИЗ
		|	ВТ_ПрочиеВычеты КАК ПрочиеВычетыДатаНачала
		|ГДЕ
		|	ПрочиеВычетыДатаНачала.ПредоставлятьВычет
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеВычетыДатаНачала.ВидВычета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Месяц,
		|	ПрочиеВычетыДатаНачала.ВидВычета
		|ИЗ
		|	ВТ_ПрочиеВычеты КАК ПрочиеВычетыДатаНачала
		|ГДЕ
		|	НЕ ПрочиеВычетыДатаНачала.ПредоставлятьВычет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидВычета,
		|	МинимумДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрочиеВычеты.ВидВычета КАК ВидВычета,
		|	ПрочиеВычеты.ДействуетС КАК ДействуетС,
		|	0 КАК Размер,
		|	ПрочиеВычеты.Основание,
		|	ПрочиеВычеты.ДействуетПо КАК ДействуетПо
		|ПОМЕСТИТЬ ВТ_Пересечения
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
		|			&Месяц,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И Регистратор <> &Документ
		|				И ВидВычета В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Т.ВидВычета
		|					ИЗ
		|						ВТ_ПрочиеВычеты КАК Т)) КАК ПрочиеВычеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Минимум КАК ВТ_Минимум
		|		ПО ПрочиеВычеты.ВидВычета = ВТ_Минимум.ВидВычета
		|			И ПрочиеВычеты.ДействуетПо >= ВТ_Минимум.МинимумДата
		|ГДЕ
		|	ПрочиеВычеты.Размер <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидВычета,
		|	ДействуетС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрочиеВычеты.ВидВычета КАК ВидВычета,
		|	ВТ_ПрочиеВычеты.ДействуетС КАК ДействуетС,
		|	ВТ_ПрочиеВычеты.Размер КАК Размер,
		|	ВТ_ПрочиеВычеты.ДействуетПо КАК ДействуетПо,
		|	ВТ_ПрочиеВычеты.ДокументПодтверждающийПравоНаВычет КАК ДокументПодтверждающийПравоНаВычет
		|ИЗ
		|	ВТ_ПрочиеВычеты КАК ВТ_ПрочиеВычеты
		|ГДЕ
		|	ВТ_ПрочиеВычеты.ПредоставлятьВычет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Пересечения.ВидВычета,
		|	ВТ_Пересечения.ДействуетС,
		|	ВТ_Пересечения.Размер,
		|	ВТ_Пересечения.ДействуетПо,
		|	ВТ_Пересечения.Основание
		|ИЗ
		|	ВТ_Пересечения КАК ВТ_Пересечения
		|ГДЕ
		|	НЕ (ВТ_Пересечения.ВидВычета, ВТ_Пересечения.ДействуетС) В
		|				(ВЫБРАТЬ
		|					Т.ВидВычета,
		|					Т.ДействуетС
		|				ИЗ
		|					ВТ_ПрочиеВычеты КАК Т
		|				ГДЕ
		|					Т.ПредоставлятьВычет)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидВычета,
		|	ДействуетС";
		
		Запрос.УстановитьПараметр("Месяц",            ДанныеОВычетах.МесяцРегистрации);
		Запрос.УстановитьПараметр("ФизическоеЛицо",   ДанныеОВычетах.ФизическоеЛицо);
		Запрос.УстановитьПараметр("Документ",         Ссылка);
		
		ПрочиеВычетыВыборка =  Запрос.Выполнить().Выбрать();
		
		Пока ПрочиеВычетыВыборка.Следующий() Цикл
			
			ЗаписьОПрочихВычетах = ТаблицаПрочиеВычеты.Добавить();
			
			ЗаписьОПрочихВычетах.ФизическоеЛицо	  					= ДанныеОВычетах.ФизическоеЛицо;
			ЗаписьОПрочихВычетах.МесяцРегистрации 					= ДанныеОВычетах.МесяцРегистрации;
			ЗаписьОПрочихВычетах.ВидВычета		 					= ПрочиеВычетыВыборка.ВидВычета;
			ЗаписьОПрочихВычетах.Размер			  					= ПрочиеВычетыВыборка.Размер;
			ЗаписьОПрочихВычетах.ДействуетПо	  					= ПрочиеВычетыВыборка.ДействуетПо;
			ЗаписьОПрочихВычетах.ДействуетС	  						= ПрочиеВычетыВыборка.ДействуетС;
			ЗаписьОПрочихВычетах.ДокументПодтверждающийПравоНаВычет	= ПрочиеВычетыВыборка.ДокументПодтверждающийПравоНаВычет;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаПрочиеВычеты;
	
КонецФункции

Функция СведенияОВычетах(ДанныеОВычетах)
	
	ТаблицаВычеты = Новый ТаблицаЗначений;
	ТаблицаВычеты.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаВычеты.Колонки.Добавить("МесяцРегистрации");
	ТаблицаВычеты.Колонки.Добавить("ДействуетПо");
	ТаблицаВычеты.Колонки.Добавить("ВидВычета");
	ТаблицаВычеты.Колонки.Добавить("ПредоставлятьВычет");
	ТаблицаВычеты.Колонки.Добавить("ДокументПодтверждающийПравоНаВычет");
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеВычеты.ВидВычетаИПН КАК ВидВычета,
	|	ЗаявлениеВычеты.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ЗаявлениеВычеты.Основание КАК СТРОКА(1000)) КАК ДокументПодтверждающийПравоНаВычет,
	|	ЗаявлениеВычеты.ПредоставлятьВычет КАК ПредоставлятьВычет,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаявлениеПрочиеВычеты.ДействуетПо, ДАТАВРЕМЯ(1, 1, 1))) КАК ДействуетПо,
	|	ЗаявлениеНаПредоставлениеВычетовИПН.МесяцЗавершения КАК МесяцЗавершения
	|ПОМЕСТИТЬ ВТ_ДанныеВычетов
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Вычеты КАК ЗаявлениеВычеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ЗаявлениеПрочиеВычеты
	|		ПО ЗаявлениеВычеты.ВидВычетаИПН = ЗаявлениеПрочиеВычеты.ВидВычетаИПН
	|			И ЗаявлениеВычеты.Ссылка = ЗаявлениеПрочиеВычеты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеНаПредоставлениеВычетовИПН КАК ЗаявлениеНаПредоставлениеВычетовИПН
	|		ПО ЗаявлениеВычеты.Ссылка = ЗаявлениеНаПредоставлениеВычетовИПН.Ссылка
	|			И ЗаявлениеВычеты.Ссылка = ЗаявлениеНаПредоставлениеВычетовИПН.Ссылка
	|ГДЕ
	|	ЗаявлениеВычеты.Ссылка = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявлениеВычеты.ВидВычетаИПН,
	|	ЗаявлениеВычеты.НомерСтроки,
	|	ЗаявлениеВычеты.ПредоставлятьВычет,
	|	ЗаявлениеНаПредоставлениеВычетовИПН.МесяцЗавершения,
	|	ВЫРАЗИТЬ(ЗаявлениеВычеты.Основание КАК СТРОКА(1000))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеВычетов.ВидВычета КАК ВидВычета,
	|	ВТ_ДанныеВычетов.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеВычетов.ДокументПодтверждающийПравоНаВычет КАК ДокументПодтверждающийПравоНаВычет,
	|	ВТ_ДанныеВычетов.ПредоставлятьВычет КАК ПредоставлятьВычет,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеВычетов.МесяцЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_ДанныеВычетов.ДействуетПо
	|		КОГДА ВТ_ДанныеВычетов.МесяцЗавершения > ВТ_ДанныеВычетов.ДействуетПо
	|			И НЕ ВТ_ДанныеВычетов.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_ДанныеВычетов.ДействуетПо
	|		ИНАЧЕ ВТ_ДанныеВычетов.МесяцЗавершения
	|	КОНЕЦ КАК ДействуетПо
	|ИЗ
	|	ВТ_ДанныеВычетов КАК ВТ_ДанныеВычетов";
	ВычетыВыборка =  Запрос.Выполнить().Выбрать();
	
	Пока ВычетыВыборка.Следующий() Цикл
		
		ЗаписьОВычетах = ТаблицаВычеты.Добавить();
		
		ЗаписьОВычетах.ФизическоеЛицо						= ДанныеОВычетах.ФизическоеЛицо;
		ЗаписьОВычетах.МесяцРегистрации						= ДанныеОВычетах.МесяцРегистрации;
		ЗаписьОВычетах.ДействуетПо							= ВычетыВыборка.ДействуетПо;
		ЗаписьОВычетах.ВидВычета							= ВычетыВыборка.ВидВычета;
		ЗаписьОВычетах.ПредоставлятьВычет					= ВычетыВыборка.ПредоставлятьВычет;
		ЗаписьОВычетах.ДокументПодтверждающийПравоНаВычет	= ВычетыВыборка.ДокументПодтверждающийПравоНаВычет;
		
	КонецЦикла;
	
	Возврат ТаблицаВычеты;
	
КонецФункции

Процедура ПроверитьПрочиеВычеты(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Вычеты.ВидВычетаИПН КАК Справочник.ВидыВычетовИПН) КАК ВидВычетаИПН,
		|	Вычеты.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Проверка
		|ИЗ
		|	&Таблица КАК Вычеты
		|ГДЕ
		|	Вычеты.ПредоставлятьВычет = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидВычетаИПН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Проверка.ВидВычетаИПН КАК ВидВычетаИПН,
		|	ВТ_Проверка.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Проверка КАК ВТ_Проверка
		|ГДЕ
		|	ВТ_Проверка.ВидВычетаИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)";
	
	Запрос.УстановитьПараметр("Таблица", Вычеты.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура("ВидВычетаИПН",Выборка.ВидВычетаИПН);
		
		Если ПрочиеВычеты.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %1 для вычета ""%2"" не заполнен график.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.НомерСтроки, Выборка.ВидВычетаИПН);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
				"Объект.Вычеты["+ (Выборка.НомерСтроки - 1) + "].ВидВычетаИПН",,Отказ);
		КонецЕсли;
		
		ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, ТекстСообщения, Выборка.ВидВычетаИПН);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНесовместимыеВычеты(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вычеты.ВидВычетаИПН КАК ВидВычетаИПН
		|ПОМЕСТИТЬ ВТ_Проверка
		|ИЗ
		|	&Таблица КАК Вычеты
		|ГДЕ
		|	Вычеты.ВидВычетаИПН В (&МассивКонфликтующихВидовВычетов)
		|	И Вычеты.ПредоставлятьВычет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВТ_Проверка.ВидВычетаИПН) КАК КоличествоВычетов
		|ИЗ
		|	ВТ_Проверка КАК ВТ_Проверка
		|";
	
	МассивКонфликтующихВидовВычетов = Новый Массив;
	МассивКонфликтующихВидовВычетов.Добавить(Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя);
	МассивКонфликтующихВидовВычетов.Добавить(Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей);
	
	Запрос.УстановитьПараметр("МассивКонфликтующихВидовВычетов", МассивКонфликтующихВидовВычетов); 
	Запрос.УстановитьПараметр("Таблица", Вычеты.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.КоличествоВычетов > 1 Тогда
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Физическому лицу может быть назначен только один из видов вычета: Вычет для многодетных семей (для каждого родителя), Вычет для многодетных семей (для одного из родителей)'"),,,,Отказ);
		    ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, НСтр("ru = 'Физическому лицу может быть назначен только один из видов вычета: Вычет для многодетных семей (для каждого родителя), Вычет для многодетных семей (для одного из родителей)'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОшибокПроверкиЗаполнения (Сотрудник, ОписаниеОшибки, ВидВычета = Неопределено, КонфликтующийРегистратор = Неопределено)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаОшибокПроверкиЗаполнения") Тогда
		СтрокаОшибка = ЭтотОбъект.ДополнительныеСвойства.ТаблицаОшибокПроверкиЗаполнения.Добавить();
		СтрокаОшибка.ФизическоеЛицо = Сотрудник;
		СтрокаОшибка.ВидВычета = ВидВычета;
		СтрокаОшибка.КонфликтующийРегистратор = КонфликтующийРегистратор;
		СтрокаОшибка.ОписаниеОшибки = ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
